var twitterlink = document.getElementById("twitterlink");
var twitterlinkTextArray = [
  "h",
  "t",
  "t",
  "p",
  "s",
  ":",
  "/",
  "/",
  "t",
  "w",
  "i",
  "t",
  "t",
  "e",
  "r",
  ".",
  "c",
  "o",
  "m",
  "/",
  "m",
  "o",
  "n",
  "o",
  "l",
  "e",
  "s",
  "a",
  "n"
];
var twitterlinkSymbolsArray = [
  "日本語の言葉 日本語の言葉͏ ͐ ͑ ͒ ͓ ͔ ͕ ͖ ͙͗͘ ͚͛ ",
  "日本語の言葉  ͠͡ ͢ ͣ ͤ ͥͦ ͧͨͩ ͪ ͮ ͯͭ 日本語の言葉͏ ͐ ͑ ͒ ͓ ͔ ͕ ͖ ͙͗͘ ͚͛ ",
  " ͔ ͕ ͖ ͙͗͘ ͚͛ ͜ ͝ ͞ ͟ ͠͡ ͢ ͣ ͤ ͥͦ ͧͨͩ ͪ ͮ ͯͭ Ͱ ͫͬ ˿ ̀ ́̂ ̃ ̄",
  " ͢ ͣ ͤ ͥͦ ͧͨͩ ͪ ͮ ͯͭ Ͱ ͫͬ ˿ ̀ ́̂ ̃ ̄ ̅̆ ̇ ̈ ̉ ̊ ̋ ̌ ̍ ̎ ̏̐ ̑ ̒ ̓̔ ̖̗̕ ̘̙ ̛̜̚ ̝̞ ̡̟̠ ̢̣ ̤̥ ̧̦ ̨ ̩̪ ̫̬̭ ̮̯ ̰̱ ̲ ̴̵̳ ̸̹ ̺ ̻ ̼ ̽ ̾ ̿ ̀ ́ ͂̓ ̈́ ͅ ͆ ͇ ͈͉ ͊ ͋͌ ͍ ͎ ͏ ͐ ͑ ͒ ͓ ͔ ͕ ͖ ͙͗͘ ͚͛ ͜ ͝ ͞ ͟ ͠͡ ͢ ͣ ͤ ͥͦ ͧͨͩ ͪ ͮ ͯͭ Ͱ ͫͬ ˿ ̀ ́̂ ̃ ̄ ̅̆ ̇ ̈ ̉ ̊ ̋ ̌ ̍ ̎ ̏̐ ̑ ̒ ̓̔ ̖̗̕ ̘̙ ̛̜̚ ̝̞ ̡̟̠ ̢̣ ̤̥ ̧̦ ̨ ̩̪ ̫̬̭ ̮̯ ̰̱ ̲ ̴̵̳ ̸̹ ̺ ̻ ̼ ̽ ̾ ̿ ̀ ́ ͂̓ ̈́ ͅ ͆ ͇ ͈͉ ͊ ͋͌ ͍",
  "нажми  ̢̣ ̤̥ ̧̦ ̨ ̩̪ ̫̬̭ ̮̯ ̰̱ ̲ ̴̵̳ ̸̹ ̺ ̻ ̼ ̽ ̾ ̿ ̀ ́ ͂̓ ̈́ ͅ ͆",
  " ͒ ͓ ͔  плеес ͖ ͙͗͘ ͚͛ ͜ ͝ ͞ ͟ ͠͡ ͢ ͣ ͤ ͥͦ ͧͨͩ ͪá̷̧̡̢̨̡̛̛̛̛̛̭̰͇̤̦̺͉̟̥̟͖͑̎͊͂̽̐͒̈̇̒́̈́̐͋̿̽͊͐̈̂̈́͗̀̆͂̔̽̆̃͑͊͗͛̈̊̏̀́̌̈̓͂̈́͒̒̂̃́̈̈́́̀̃̅̑̂̿́͛̇̈̑̅̚̕̚͘͜͜͠͝͠h̸̨̧̡̧̧̡̧̧̡̧̨̧̨̨̡̛̛̛̛̛̛̛͔̜̘͓̭̳̤̖̦̟͕̰͓̟͚̠͉̹̲̼̬̪̭̣̮̫͎͇̪̹̳̥͈͖̮͉̙͕̪̱̣̙̼͚̪̼͚̭̝̻̥̠̰̬̬̻̺̗͙̣̟̠͖̙̻͉̣̬͓͔̗̥̫͙̹̦̰̦̠̖̰̦̫̱͓̦̜̩̪̝̼̮̩̤̤̜̙̰̫̺̝͙̱͔̱̹̜͕͇͖̲͔̣̼̗̺̬̗͚̲͍͖̭̺̗̜̘͇̫̜̘̖̗̜̦̙̠̅̂̓͐̾̊͑͛̊̾̉͌̾̎̈́̑̽̋̀͌͒̈́̃̈́̔͌͑̄̃́͋̏̏͊̏̎̊͒̀̓͌̌̐͐͂́͑̏̽̈́͌̉̑͐͐̌́̓̓̃̈́̍́̇͛̂́͋̈̾̏̒̋̀̋̌̋̎̌̍̍̒̅̇̄́̿̓͂͐̒̽͑̀͌̑̌̓̉̏͂̑̅͐̾̾̿̀̅̒̇̓̌̾̔̃̿̇̉͆͑͌͆̎̃̍͌̈́̂͆̽͂̎̆̈́̆̅̓̔͛̇͑͗͐̌́̍̊̇̇͗͌͒̔̔̀̉͋́̇͂̈͗̔͛͒̂̀̂̑͊̀͛̈̋̏̋͌̇̃̈́̀̂́̾̈́͛̒̌̆̾͌̐͌͌͆̋̔̂͘̚̕̚͘͘͘̚̕̕͘͘͘̚̕͘̕̕͜͜͠͝͠͝͝͠͝͝͝͝͝͠ͅͅͅả̶̢̢̢̧̧̨̨̡̨̧̢̛̛̛̛̛̛̦͈̖̺̳̥͓͈̙͓͓̝̞͔̭̘̭̻͇̰̖̱̫̗͕͇̺̭̹̟͍͙̺̰͓̝̙̝͇͕͉͍̹͕̖̱̙͎͈̤̳͈̣̪͍͔͕̤̜̼̻͔͙̰̦͇͍̬͇̤͔͔̝̠̲̥̳̪͍̺̹̝̰̠̳̰̓̈́̀̌̊̇̓̽̏͛̍̇̓̔̓̈́̉̌̌̃̑͗̀͂́̃̓̓̓̂̾̓͐̐̌̈̑̅̏̅͛̾̏͑̉̈͛͆̀̏͐̀̅͋́́̾̋͊͛̌̍̐͒̋̊̈́̍̀͑͂͌̀̐̅̅̅͌͑̑͂̈́̈́̂̊̽̆̋̐̾̀͐͋͂̋̿̀͌̄̈̌̓̿̏̈̋̓͒̓͂͛̈́͋̏́͐̀̿̓̔͂̏̓̊̔͑͊̈́̇̾́̐̑̈́͊̋̈́̄́̋̈́̾͌̀̓͛̈́̆͋̄̓̋͌͌̈́̈́̉͌̂̅̏̈́̓̍́̃̈́̋̒̑̊̿͑͊̊͂̏́̍̀̌͗̐̑͒̃͊̀̿̅̓̈́͌͊̆̇͊̈͑̑̒̎̒̌̑̓̑͛͋̕̚̕̕̕͘͘̚̚͘̕̕̚͘͜͜͝͝͝͝͝͝͠͠͝͠͝͝͝͝͝ͅḩ̴̧̢̡̢̨̛͎̠̭͔̥͎̠̰̻̱̯͔̙̥̩͔̤͉̣͎̤͓̗̝̗͎͚͙̣͓̪̜͍̠̗̥̱̹͙͙͓̝̭͙̟̱͍͖̠͍̬̲͈͈̰̥͎̠̺͉̤̟͔͙̳̖̠͇͖̳͖̠͉̲̘̟̞̦̖͎͓͚͓͕̟̙̖̘́̊͂̿̃͂͑̌̒̓́̿͒̃́͌͊̔̉͒̔̈́̋͆̄̓̅͐̃̊́̋̇̚̕̕͜͜͜͠͠͠ͅͅȃ̵̡̡̡̢̧̡̧̨̢̡̨̨̨̧̧̢̧̡̨̢̧̡̢̨̨̛̛̼̱̞̩͎̤͔͚͉̥̮̝̫͖̫͉̭̙̝̰̪̜̬̥͔͕̤͍̹̖̭̦̭̯̝̟̙̼̪̰͇̳͔̣̤͉͔̗̞̺̬͔̲̖̗̠̫̱̼͇̰̟̲̭̲̭̫̫͍̥͎̹̲̝̥͉̱̮̖͖͙͕̗͚̱͇͙̞̝̤̖͉̣͎̥̹͇͓̣̱̦͖̼͕̼̮̬͉̦̪͇̺̟̬̗͎͕̞̺͙͇͈̬͈̣̰̝͚̥̝͕̜̫͎̲̯̹̰̦̭̲̞͙̦͈̜͎̭̬͇͍̣̙͇̹̼̣̩̺̞̺̪̟̟̳̻̩̠̭̭̹̼̟̯̠̟͎̮̲̣͖͓͕̮̙̰̪͓͇͚̤͓̱̱͚̙͇̲̞̭̠̣̥͈͍͉̰̣͍͔̻̊̾͌͐̑̀̈́̀͌̌͒͌͗̿̾̈́̀̈́̒̾͛̀͋͛͋͒͑́̍̀͒́̈̓̓̒͒̏͗̉͋̒͒̏̈́̈́̿̊̈̌̈́̏̍̌̏̇̊͌̀̉̏̈́̔̀͒̈́̽͂̆̇̀̄̃͆̀̃̒̊̀͋͋̓͆̌̕̚͘͘̕̚͘̕͘͜͜͜͜͜͜͜͜͠͠͠͠͝͝͝ͅͅͅͅͅͅͅẖ̶̨̡̡̨̢̹̤̺͙̜͎̬̫͍̖̮̮̪͖̤̣͉̞̭̱̖͍̮̘̞̹̼̬͎̱͕̦͍͕͇̗̖̮͕͍̱̦̲̲̯̤̝̘̲̩̘͖͙̖̹̤̹̰͉͔̟̮̰̤̣͔̖̳͕̠̲͈̟̺̭̝̩͚̹͈͔͎͈̪͖͈͎̰͇̝̹͙̖͍̝̘̬̫̠̯̤̙͇͙͉̝̥̿̄̍̽̂̂́̓̾̋̀̍́͒̊̓̒̈́̏̐͐̔͒̎͛̉̂̑͋̏͑̔̒̑̔̏͋̅̆̾͋̐̇͒͛͗̉̃̔̌̔͘̕͘͘͜͜͜͝͠͝͝͝͝ͅ",
  " ̶̢̡̡̢̡̡̨̧̛̛̛̛̛̛̺̪̰̜̳̙̫͎͉̜̘͉̣̰̣͇̗̱̮̩̞̩͚̯̼̳͚͇͍͈̩̭̭̭͖̤͖̼̳̙̼̰̗̠̳͔͇̹̫̠̻̜̼̩̼̬̲̤̟̠̖̼̤̯̩̭̪̜͍̞̠̞͚͖̫̯̫̩̰͉̞̟̫̮̤̺̱͉̲̤̩̼̺̞̝̦̪̱́̇͛̿͆͐̏͊͛̓̂́͒͛̎̓͗̔̆̔̑̀̈́́̀́̊͗̾͑͐͒͊̈̑͛̈́̄̓̋̿̄͛̈́͑͆̊̒͆͑̌͒̀̄̓̔͗̍͌͊̓̏͌̅̑̉͛̋͆͊͆͋̓́͑̾̀̓͋̌̀͆̊̇͊̄́͐́̏̋̇̿̉̉̏͆͛͆̾̈͗̅̏̀̔̓̈̈́̏̀̔̾̈́̅́̄̋͗̌̓͊̔͒̅̌̉̎̐͛̽̔̈̄̄̄̏̋̿̏̾̿̌̄̽̑̽̀͛͐̅̔̒̈́̉̿̏̑̓͑̉͋́̀̇̅̏̀̀͛̋͗͊̀̓̏̽̑̍̋̀̓̊̐̅͌̅̑̆̑̈́̔̀͛̄̅̃̇͒̽̅͊͂̃̇̔͌̊̓́͐̆̏̓̎̈́͒̾̀̓̾̋̈́̆̀͗̆̅̂͌͐͋͘̚͘̕͘͘͘̕̚̕̕͘̕̚͘̚̕͜͜͜͜͝͠͠͝͠͠ͅͅļ̶̡̧̢̨̢̧̧̡̨̧̧̡̢̡̢̧̧̢̡̧̡̨̡̧̢̛̛̛̛͙͓͎̺̺͓̟̬̼͕͈͎̝͉̗͙̯̳̦̝̲̝͈̳̙͍͎͖̠̟̪̗͍̲̣̲̣̟̬͈̗̖̹̞̞̤̥̹͍̞̯̼̳̟̦̠̫͚̺̜̬͓̙̙̹̖̤̳̠̱͓͖͈̼̱̖͕̣͈̰͇̻̣͕̯̟̞̜̯͖͈̫̝͔͎͚̮̥̦̠̟̪͍͖̱͙̖̱̱͕̙͖͔̝̥͍͙͓̗̤͙̼̙̯̩͈͇̣͔̼̗̹̖̜̦͓̝̤̞̭͖͇̫̖̞̗͚̪̖̟̘̲͕̮͖͕͙̥͍̬͖̘͇̞̜͖͖̫͍̼͕̥̭͓̘̯͓̦̬̻̬͍̜̯͔͕͚̼̤̞̲̣̤̝͍̰̯̬̫̹̩̬͎̪̲̲̣̤͔̫̠̄̓̽͑̔̂͋̈́̊̊̔͒͐̇̒͑̈́́̎̎̿̒̍̍̃͊̈́́̂͑̒̈́̉̈́́̅̃̓͛̂̈́͑͋̆̽̽̒̌̄̽̿̅̋̃͛͐̒̄̈́̃͗̍͗̀̆̅̈́͆̉̑̐́́̆̿̀̀͗̀͛̅̊̀̒́̀͂̀̌̂͆̋͑̂͒̊̒̑̎̅͊̃͌̂͂́̅̉͆̂̒̿͂̃̿̉̃̀̌̓̂͆͊̑̒̾̿̀̃̎̈́͂̋̏̀͒̈́͆͌̈́̅̋̓͂̀͌̔͗̊̌̽̊̌͆̾̄̔̀͗̓̂̃̐̐̈͋̌͌̓͛͆̎̀̊̀́̀̈́͐͒́͆̓̈́̍͋̎͆̽͌̀́̐͌̀̈́̾̾̿́̍̀͗̂̀̀̎͗͑̌͆̌̔̆̑͐̓̐͆̋͗̐̽̊̈̃͂̈́̅̈͋́̃̕̕͘̚̕̕̚͘̕̚̕͘̚͘̕̕͘̚͜͜͜͜͜͠͝͠͠͝͝͝͠͝͠͝͝͝ͅͅͅ ͮ ͯͭ Ͱ ͫͬ ˿ ̀",
  "l",
  "l",
  "日本語の言葉 日本語の言葉͏ ͐ ͑ ͒ ͓ ͔ ͕ ͖ ͙͗͘ ͚͛ ",
  "日本語の言葉  ͠͡ ͢ ͣ ͤ ͥͦ ͧͨͩ ͪ ͮ ͯͭ 日本語の言葉͏ ͐ ͑ ͒ ͓ ͔ ͕ ͖ ͙͗͘ ͚͛ ",
  " ͔ ͕ ͖ ͙͗͘ ͚͛ ͜ ͝ ͞ ͟ ͠͡ ͢ ͣ ͤ ͥͦ ͧͨͩ ͪ ͮ ͯͭ Ͱ ͫͬ ˿ ̀ ́̂ ̃ ̄",
  " ͢ ͣ ͤ ͥͦ ͧͨͩ ͪ ͮ ͯͭ Ͱ ͫͬ ˿ ̀ ́̂ ̃ ̄ ̅̆ ̇ ̈ ̉ ̊ ̋ ̌ ̍ ̎ ̏̐ ̑ ̒ ̓̔ ̖̗̕ ̘̙ ̛̜̚ ̝̞ ̡̟̠ ̢̣ ̤̥ ̧̦ ̨ ̩̪ ̫̬̭ ̮̯ ̰̱ ̲ ̴̵̳ ̸̹ ̺ ̻ ̼ ̽ ̾ ̿ ̀ ́ ͂̓ ̈́ ͅ ͆ ͇ ͈͉ ͊ ͋͌ ͍ ͎ ͏ ͐ ͑ ͒ ͓ ͔ ͕ ͖ ͙͗͘ ͚͛ ͜ ͝ ͞ ͟ ͠͡ ͢ ͣ ͤ ͥͦ ͧͨͩ ͪ ͮ ͯͭ Ͱ ͫͬ ˿ ̀ ́̂ ̃ ̄ ̅̆ ̇ ̈ ̉ ̊ ̋ ̌ ̍ ̎ ̏̐ ̑ ̒ ̓̔ ̖̗̕ ̘̙ ̛̜̚ ̝̞ ̡̟̠ ̢̣ ̤̥ ̧̦ ̨ ̩̪ ̫̬̭ ̮̯ ̰̱ ̲ ̴̵̳ ̸̹ ̺ ̻ ̼ ̽ ̾ ̿ ̀ ́ ͂̓ ̈́ ͅ ͆ ͇ ͈͉ ͊ ͋͌ ͍",
  "нажми  ̢̣ ̤̥ ̧̦ ̨ ̩̪ ̫̬̭ ̮̯ ̰̱ ̲ ̴̵̳ ̸̹ ̺ ̻ ̼ ̽ ̾ ̿ ̀ ́ ͂̓ ̈́ ͅ ͆",
  " ͒ ͓ ͔  плеес ͖ ͙͗͘ ͚͛ ͜ ͝ ͞ ͟ ͠͡ ͢ ͣ ͤ ͥͦ ͧͨͩ ͪá̷̧̡̢̨̡̛̛̛̛̛̭̰͇̤̦̺͉̟̥̟͖͑̎͊͂̽̐͒̈̇̒́̈́̐͋̿̽͊͐̈̂̈́͗̀̆͂̔̽̆̃͑͊͗͛̈̊̏̀́̌̈̓͂̈́͒̒̂̃́̈̈́́̀̃̅̑̂̿́͛̇̈̑̅̚̕̚͘͜͜͠͝͠h̸̨̧̡̧̧̡̧̧̡̧̨̧̨̨̡̛̛̛̛̛̛̛͔̜̘͓̭̳̤̖̦̟͕̰͓̟͚̠͉̹̲̼̬̪̭̣̮̫͎͇̪̹̳̥͈͖̮͉̙͕̪̱̣̙̼͚̪̼͚̭̝̻̥̠̰̬̬̻̺̗͙̣̟̠͖̙̻͉̣̬͓͔̗̥̫͙̹̦̰̦̠̖̰̦̫̱͓̦̜̩̪̝̼̮̩̤̤̜̙̰̫̺̝͙̱͔̱̹̜͕͇͖̲͔̣̼̗̺̬̗͚̲͍͖̭̺̗̜̘͇̫̜̘̖̗̜̦̙̠̅̂̓͐̾̊͑͛̊̾̉͌̾̎̈́̑̽̋̀͌͒̈́̃̈́̔͌͑̄̃́͋̏̏͊̏̎̊͒̀̓͌̌̐͐͂́͑̏̽̈́͌̉̑͐͐̌́̓̓̃̈́̍́̇͛̂́͋̈̾̏̒̋̀̋̌̋̎̌̍̍̒̅̇̄́̿̓͂͐̒̽͑̀͌̑̌̓̉̏͂̑̅͐̾̾̿̀̅̒̇̓̌̾̔̃̿̇̉͆͑͌͆̎̃̍͌̈́̂͆̽͂̎̆̈́̆̅̓̔͛̇͑͗͐̌́̍̊̇̇͗͌͒̔̔̀̉͋́̇͂̈͗̔͛͒̂̀̂̑͊̀͛̈̋̏̋͌̇̃̈́̀̂́̾̈́͛̒̌̆̾͌̐͌͌͆̋̔̂͘̚̕̚͘͘͘̚̕̕͘͘͘̚̕͘̕̕͜͜͠͝͠͝͝͠͝͝͝͝͝͠ͅͅͅả̶̢̢̢̧̧̨̨̡̨̧̢̛̛̛̛̛̛̦͈̖̺̳̥͓͈̙͓͓̝̞͔̭̘̭̻͇̰̖̱̫̗͕͇̺̭̹̟͍͙̺̰͓̝̙̝͇͕͉͍̹͕̖̱̙͎͈̤̳͈̣̪͍͔͕̤̜̼̻͔͙̰̦͇͍̬͇̤͔͔̝̠̲̥̳̪͍̺̹̝̰̠̳̰̓̈́̀̌̊̇̓̽̏͛̍̇̓̔̓̈́̉̌̌̃̑͗̀͂́̃̓̓̓̂̾̓͐̐̌̈̑̅̏̅͛̾̏͑̉̈͛͆̀̏͐̀̅͋́́̾̋͊͛̌̍̐͒̋̊̈́̍̀͑͂͌̀̐̅̅̅͌͑̑͂̈́̈́̂̊̽̆̋̐̾̀͐͋͂̋̿̀͌̄̈̌̓̿̏̈̋̓͒̓͂͛̈́͋̏́͐̀̿̓̔͂̏̓̊̔͑͊̈́̇̾́̐̑̈́͊̋̈́̄́̋̈́̾͌̀̓͛̈́̆͋̄̓̋͌͌̈́̈́̉͌̂̅̏̈́̓̍́̃̈́̋̒̑̊̿͑͊̊͂̏́̍̀̌͗̐̑͒̃͊̀̿̅̓̈́͌͊̆̇͊̈͑̑̒̎̒̌̑̓̑͛͋̕̚̕̕̕͘͘̚̚͘̕̕̚͘͜͜͝͝͝͝͝͝͠͠͝͠͝͝͝͝͝ͅḩ̴̧̢̡̢̨̛͎̠̭͔̥͎̠̰̻̱̯͔̙̥̩͔̤͉̣͎̤͓̗̝̗͎͚͙̣͓̪̜͍̠̗̥̱̹͙͙͓̝̭͙̟̱͍͖̠͍̬̲͈͈̰̥͎̠̺͉̤̟͔͙̳̖̠͇͖̳͖̠͉̲̘̟̞̦̖͎͓͚͓͕̟̙̖̘́̊͂̿̃͂͑̌̒̓́̿͒̃́͌͊̔̉͒̔̈́̋͆̄̓̅͐̃̊́̋̇̚̕̕͜͜͜͠͠͠ͅͅȃ̵̡̡̡̢̧̡̧̨̢̡̨̨̨̧̧̢̧̡̨̢̧̡̢̨̨̛̛̼̱̞̩͎̤͔͚͉̥̮̝̫͖̫͉̭̙̝̰̪̜̬̥͔͕̤͍̹̖̭̦̭̯̝̟̙̼̪̰͇̳͔̣̤͉͔̗̞̺̬͔̲̖̗̠̫̱̼͇̰̟̲̭̲̭̫̫͍̥͎̹̲̝̥͉̱̮̖͖͙͕̗͚̱͇͙̞̝̤̖͉̣͎̥̹͇͓̣̱̦͖̼͕̼̮̬͉̦̪͇̺̟̬̗͎͕̞̺͙͇͈̬͈̣̰̝͚̥̝͕̜̫͎̲̯̹̰̦̭̲̞͙̦͈̜͎̭̬͇͍̣̙͇̹̼̣̩̺̞̺̪̟̟̳̻̩̠̭̭̹̼̟̯̠̟͎̮̲̣͖͓͕̮̙̰̪͓͇͚̤͓̱̱͚̙͇̲̞̭̠̣̥͈͍͉̰̣͍͔̻̊̾͌͐̑̀̈́̀͌̌͒͌͗̿̾̈́̀̈́̒̾͛̀͋͛͋͒͑́̍̀͒́̈̓̓̒͒̏͗̉͋̒͒̏̈́̈́̿̊̈̌̈́̏̍̌̏̇̊͌̀̉̏̈́̔̀͒̈́̽͂̆̇̀̄̃͆̀̃̒̊̀͋͋̓͆̌̕̚͘͘̕̚͘̕͘͜͜͜͜͜͜͜͜͠͠͠͠͝͝͝ͅͅͅͅͅͅͅẖ̶̨̡̡̨̢̹̤̺͙̜͎̬̫͍̖̮̮̪͖̤̣͉̞̭̱̖͍̮̘̞̹̼̬͎̱͕̦͍͕͇̗̖̮͕͍̱̦̲̲̯̤̝̘̲̩̘͖͙̖̹̤̹̰͉͔̟̮̰̤̣͔̖̳͕̠̲͈̟̺̭̝̩͚̹͈͔͎͈̪͖͈͎̰͇̝̹͙̖͍̝̘̬̫̠̯̤̙͇͙͉̝̥̿̄̍̽̂̂́̓̾̋̀̍́͒̊̓̒̈́̏̐͐̔͒̎͛̉̂̑͋̏͑̔̒̑̔̏͋̅̆̾͋̐̇͒͛͗̉̃̔̌̔͘̕͘͘͜͜͜͝͠͝͝͝͝ͅ ̶̢̡̡̢̡̡̨̧̛̛̛̛̛̛̺̪̰̜̳̙̫͎͉̜̘͉̣̰̣͇̗̱̮̩̞̩͚̯̼̳͚͇͍͈̩̭̭̭͖̤͖̼̳̙̼̰̗̠̳͔͇̹̫̠̻̜̼̩̼̬̲̤̟̠̖̼̤̯̩̭̪̜͍̞̠̞͚͖̫̯̫̩̰͉̞̟̫̮̤̺̱͉̲̤̩̼̺̞̝̦̪̱́̇͛̿͆͐̏͊͛̓̂́͒͛̎̓͗̔̆̔̑̀̈́́̀́̊͗̾͑͐͒͊̈̑͛̈́̄̓̋̿̄͛̈́͑͆̊̒͆͑̌͒̀̄̓̔͗̍͌͊̓̏͌̅̑̉͛̋͆͊͆͋̓́͑̾̀̓͋̌̀͆̊̇͊̄́͐́̏̋̇̿̉̉̏͆͛͆̾̈͗̅̏̀̔̓̈̈́̏̀̔̾̈́̅́̄̋͗̌̓͊̔͒̅̌̉̎̐͛̽̔̈̄̄̄̏̋̿̏̾̿̌̄̽̑̽̀͛͐̅̔̒̈́̉̿̏̑̓͑̉͋́̀̇̅̏̀̀͛̋͗͊̀̓̏̽̑̍̋̀̓̊̐̅͌̅̑̆̑̈́̔̀͛̄̅̃̇͒̽̅͊͂̃̇̔͌̊̓́͐̆̏̓̎̈́͒̾̀̓̾̋̈́̆̀͗̆̅̂͌͐͋͘̚͘̕͘͘͘̕̚̕̕͘̕̚͘̚̕͜͜͜͜͝͠͠͝͠͠ͅͅļ̶̡̧̢̨̢̧̧̡̨̧̧̡̢̡̢̧̧̢̡̧̡̨̡̧̢̛̛̛̛͙͓͎̺̺͓̟̬̼͕͈͎̝͉̗͙̯̳̦̝̲̝͈̳̙͍͎͖̠̟̪̗͍̲̣̲̣̟̬͈̗̖̹̞̞̤̥̹͍̞̯̼̳̟̦̠̫͚̺̜̬͓̙̙̹̖̤̳̠̱͓͖͈̼̱̖͕̣͈̰͇̻̣͕̯̟̞̜̯͖͈̫̝͔͎͚̮̥̦̠̟̪͍͖̱͙̖̱̱͕̙͖͔̝̥͍͙͓̗̤͙̼̙̯̩͈͇̣͔̼̗̹̖̜̦͓̝̤̞̭͖͇̫̖̞̗͚̪̖̟̘̲͕̮͖͕͙̥͍̬͖̘͇̞̜͖͖̫͍̼͕̥̭͓̘̯͓̦̬̻̬͍̜̯͔͕͚̼̤̞̲̣̤̝͍̰̯̬̫̹̩̬͎̪̲̲̣̤͔̫̠̄̓̽͑̔̂͋̈́̊̊̔͒͐̇̒͑̈́́̎̎̿̒̍̍̃͊̈́́̂͑̒̈́̉̈́́̅̃̓͛̂̈́͑͋̆̽̽̒̌̄̽̿̅̋̃͛͐̒̄̈́̃͗̍͗̀̆̅̈́͆̉̑̐́́̆̿̀̀͗̀͛̅̊̀̒́̀͂̀̌̂͆̋͑̂͒̊̒̑̎̅͊̃͌̂͂́̅̉͆̂̒̿͂̃̿̉̃̀̌̓̂͆͊̑̒̾̿̀̃̎̈́͂̋̏̀͒̈́͆͌̈́̅̋̓͂̀͌̔͗̊̌̽̊̌͆̾̄̔̀͗̓̂̃̐̐̈͋̌͌̓͛͆̎̀̊̀́̀̈́͐͒́͆̓̈́̍͋̎͆̽͌̀́̐͌̀̈́̾̾̿́̍̀͗̂̀̀̎͗͑̌͆̌̔̆̑͐̓̐͆̋͗̐̽̊̈̃͂̈́̅̈͋́̃̕̕͘̚̕̕̚͘̕̚̕͘̚͘̕̕͘̚͜͜͜͜͜͠͝͠͠͝͝͝͠͝͠͝͝͝ͅͅͅ ͮ ͯͭ Ͱ ͫͬ ˿ ̀",
  "日本語の言葉 日本語の言葉͏ ͐ ͑ ͒ ͓ ͔ ͕ ͖ ͙͗͘ ͚͛ ",
  "l",
  "l",
  "l",
  "日本語の言葉  ͠͡ ͢ ͣ ͤ ͥͦ ͧͨͩ ͪ ͮ ͯͭ 日本語の言葉͏ ͐ ͑ ͒ ͓ ͔ ͕ ͖ ͙͗͘ ͚͛ ",
  " ͔ ͕ ͖ ͙͗͘ ͚͛ ͜ ͝ ͞ ͟ ͠͡ ͢ ͣ ͤ ͥͦ ͧͨͩ ͪ ͮ ͯͭ Ͱ ͫͬ ˿ ̀ ́̂ ̃ ̄",
  " ͢ ͣ ͤ ͥͦ ͧͨͩ ͪ ͮ ͯͭ Ͱ ͫͬ ˿ ̀ ́̂ ̃ ̄ ̅̆",
  " ͏ ͐ ͑ ͒ ͓ ͔ ͕ ͖ ͙͗͘ ͚͛ ͜ ͝ ͞",
  " ͏ ͐ ͑ ͒ ͓ ͔ ͕ ͖ ͙͗͘ ͚͛ ͜ ͝ ͞ ͟ ͠͡ ͢ ͣ ͤ ͥͦ ͧͨͩ ͪ ͮ ͯͭ Ͱ ͫͬ",
  " ̇ ̈ ̉ ̊ ̋ ̌ ̍ ̎ ̏̐ ̑ ̒ ̓̔ ̖̗̕ ̘̙ ̛̜̚ ̝̞ ̡̟̠ ̢̣ ̤̥ ̧̦ ̨ ̩̪ ̫̬̭ ̮̯ ̰̱ ̲ ̴̵̳ ̸̹ ̺ ̻ ̼ ̽ ̾ ̿ ̀ ́ ͂̓ ̈́ ͅ ͆ ͇ ͈͉ ͊ ͋͌ ͍ ͎ ͏ ͐ ͑ ͒ ͓ ͔ ͕ ͖ ͙͗͘ ͚͛ ͜ ͝ ͞ ͟ ͠͡ ͢ ͣ ͤ ͥͦ ͧͨͩ ͪ ͮ ͯͭ Ͱ ͫͬ ˿ ̀ ́̂ ̃ ̄ ̅̆ ̇ ̈ ̉ ̊ ̋ ̌ ̍ ̎ ̏̐ ̑ ̒ ̓̔ ̖̗̕ ̘̙ ̛̜̚ ̝̞ ̡̟̠ ̢̣ ̤̥ ̧̦ ̨ ̩̪ ̫̬̭ ̮̯ ̰̱ ̲ ̴̵̳ ̸̹ ̺ ̻ ̼ ̽ ̾ ̿ ̀ ́ ͂̓ ̈́ ͅ ͆ ͇ ͈͉ ͊ ͋͌ ͍",
  "нажми  ̢̣ ̤̥ ̧̦ ̨ ̩̪ ̫̬̭ ̮̯ ̰̱ ̲ ̴̵̳ ̸̹ ̺ ̻ ̼ ̽ ̾ ̿ ̀ ́ ͂̓ ̈́ ͅ ͆",
  " ͒ ͓ ͔  плеес ͖ ͙͗͘ ͚͛ ͜ ͝ ͞ ͟ ͠͡ ͢ ͣ ͤ ͥͦ ͧͨͩ ͪá̷̧̡̢̨̡̛̛̛̛̛̭̰͇̤̦̺͉̟̥̟͖͑̎͊͂̽̐͒̈̇̒́̈́̐͋̿̽͊͐̈̂̈́͗̀̆͂̔̽̆̃͑͊͗͛̈̊̏̀́̌̈̓͂̈́͒̒̂̃́̈̈́́̀̃̅̑̂̿́͛̇̈̑̅̚̕̚͘͜͜͠͝͠h̸̨̧̡̧̧̡̧̧̡̧̨̧̨̨̡̛̛̛̛̛̛̛͔̜̘͓̭̳̤̖̦̟͕̰͓̟͚̠͉̹̲̼̬̪̭̣̮̫͎͇̪̹̳̥͈͖̮͉̙͕̪̱̣̙̼͚̪̼͚̭̝̻̥̠̰̬̬̻̺̗͙̣̟̠͖̙̻͉̣̬͓͔̗̥̫͙̹̦̰̦̠̖̰̦̫̱͓̦̜̩̪̝̼̮̩̤̤̜̙̰̫̺̝͙̱͔̱̹̜͕͇͖̲͔̣̼̗̺̬̗͚̲͍͖̭̺̗̜̘͇̫̜̘̖̗̜̦̙̠̅̂̓͐̾̊͑͛̊̾̉͌̾̎̈́̑̽̋̀͌͒̈́̃̈́̔͌͑̄̃́͋̏̏͊̏̎̊͒̀̓͌̌̐͐͂́͑̏̽̈́͌̉̑͐͐̌́̓̓̃̈́̍́̇͛̂́͋̈̾̏̒̋̀̋̌̋̎̌̍̍̒̅̇̄́̿̓͂͐̒̽͑̀͌̑̌̓̉̏͂̑̅͐̾̾̿̀̅̒̇̓̌̾̔̃̿̇̉͆͑͌͆̎̃̍͌̈́̂͆̽͂̎̆̈́̆̅̓̔͛̇͑͗͐̌́̍̊̇̇͗͌͒̔̔̀̉͋́̇͂̈͗̔͛͒̂̀̂̑͊̀͛̈̋̏̋͌̇̃̈́̀̂́̾̈́͛̒̌̆̾͌̐͌͌͆̋̔̂͘̚̕̚͘͘͘̚̕̕͘͘͘̚̕͘̕̕͜͜͠͝͠͝͝͠͝͝͝͝͝͠ͅͅͅ ͏ ͐ ͑ ͒ ͓ ͔ ͕ ͖ ͙͗͘ ͚͛ ͜ ͝ ͞ ͟ ͠͡ ͢ ͣ ͤ ͥͦ ͧͨͩ ͪ ͮ ͯͭ Ͱ ͫͬả̶̢̢̢̧̧̨̨̡̨̧̢̛̛̛̛̛̛̦͈̖̺̳̥͓͈̙͓͓̝̞͔̭̘̭̻͇̰̖̱̫̗͕͇̺̭̹̟͍͙̺̰͓̝̙̝͇͕͉͍̹͕̖̱̙͎͈̤̳͈̣̪͍͔͕̤̜̼̻͔͙̰̦͇͍̬͇̤͔͔̝̠̲̥̳̪͍̺̹̝̰̠̳̰̓̈́̀̌̊̇̓̽̏͛̍̇̓̔̓̈́̉̌̌̃̑͗̀͂́̃̓̓̓̂̾̓͐̐̌̈̑̅̏̅͛̾̏͑̉̈͛͆̀̏͐̀̅͋́́̾̋͊͛̌̍̐͒̋̊̈́̍̀͑͂͌̀̐̅̅̅͌͑̑͂̈́̈́̂̊̽̆̋̐̾̀͐͋͂̋̿̀͌̄̈̌̓̿̏̈̋̓͒̓͂͛̈́͋̏́͐̀̿̓̔͂̏̓̊̔͑͊̈́̇̾́̐̑̈́͊̋̈́̄́̋̈́̾͌̀̓͛̈́̆͋̄̓̋͌͌̈́̈́̉͌̂̅̏̈́̓̍́̃̈́̋̒̑̊̿͑͊̊͂̏́̍̀̌͗̐̑͒̃͊̀̿̅̓̈́͌͊̆̇͊̈͑̑̒̎̒̌̑̓̑͛͋̕̚̕̕̕͘͘̚̚͘̕̕̚͘͜͜͝͝͝͝͝͝͠͠͝͠͝͝͝͝͝ͅḩ̴̧̢̡̢̨̛͎̠̭͔̥͎̠̰̻̱̯͔̙̥̩͔̤͉̣͎̤͓̗̝̗͎͚͙̣͓̪̜͍̠̗̥̱̹͙͙͓̝̭͙̟̱͍͖̠͍̬̲͈͈̰̥͎̠̺͉̤̟͔͙̳̖̠͇͖̳͖̠͉̲̘̟̞̦̖͎͓͚͓͕̟̙̖̘́̊͂̿̃͂͑̌̒̓́̿͒̃́͌͊̔̉͒̔̈́̋͆̄̓̅͐̃̊́̋̇̚̕̕͜͜͜͠͠͠ͅͅȃ̵̡̡̡̢̧̡̧̨̢̡̨̨̨̧̧̢̧̡̨̢̧̡̢̨̨̛̛̼̱̞̩͎̤͔͚͉̥̮̝̫͖̫͉̭̙̝̰̪̜̬̥͔͕̤͍̹̖̭̦̭̯̝̟̙̼̪̰͇̳͔̣̤͉͔̗̞̺̬͔̲̖̗̠̫̱̼͇̰̟̲̭̲̭̫̫͍̥͎̹̲̝̥͉̱̮̖͖͙͕̗͚̱͇͙̞̝̤̖͉̣͎̥̹͇͓̣̱̦͖̼͕̼̮̬͉̦̪͇̺̟̬̗͎͕̞̺͙͇͈̬͈̣̰̝͚̥̝͕̜̫͎̲̯̹̰̦̭̲̞͙̦͈̜͎̭̬͇͍̣̙͇̹̼̣̩̺̞̺̪̟̟̳̻̩̠̭̭̹̼̟̯̠̟͎̮̲̣͖͓͕̮̙̰̪͓͇͚̤͓̱̱͚̙͇̲̞̭̠̣̥͈͍͉̰̣͍͔̻̊̾͌͐̑̀̈́̀͌̌͒͌͗̿̾̈́̀̈́̒̾͛̀͋͛͋͒͑́̍̀͒́̈̓̓̒͒̏͗̉͋̒͒̏̈́̈́̿̊̈̌̈́̏̍̌̏̇̊͌̀̉̏̈́̔̀͒̈́̽͂̆̇̀̄̃͆̀̃̒̊̀͋͋̓͆̌̕̚͘͘̕̚͘̕͘͜͜͜͜͜͜͜͜͠͠͠͠͝͝͝ͅͅͅͅͅͅͅẖ̶̨̡̡̨̢̹̤̺͙̜͎̬̫͍̖̮̮̪͖̤̣͉̞̭̱̖͍̮̘̞̹̼̬͎̱͕̦͍͕͇̗̖̮͕͍̱̦̲̲̯̤̝̘̲̩̘͖͙̖̹̤̹̰͉͔̟̮̰̤̣͔̖̳͕̠̲͈̟̺̭̝̩͚̹͈͔͎͈̪͖͈͎̰͇̝̹͙̖͍̝̘̬̫̠̯̤̙͇͙͉̝̥̿̄̍̽̂̂́̓̾̋̀̍́͒̊̓̒̈́̏̐͐̔͒̎͛̉̂̑͋̏͑̔̒̑̔̏͋̅̆̾͋̐̇͒͛͗̉̃̔̌̔͘̕͘͘͜͜͜͝͠͝͝͝͝ͅ ̶̢̡̡̢̡̡̨̧̛̛̛̛̛̛̺̪̰̜̳̙̫͎͉̜̘͉̣̰̣͇̗̱̮̩̞̩͚̯̼̳͚͇͍͈̩̭̭̭͖̤͖̼̳̙̼̰̗̠̳͔͇̹̫̠̻̜̼̩̼̬̲̤̟̠̖̼̤̯̩̭̪̜͍̞̠̞͚͖̫̯̫̩̰͉̞̟̫̮̤̺̱͉̲̤̩̼̺̞̝̦̪̱́̇͛̿͆͐̏͊͛̓̂́͒͛̎̓͗̔̆̔̑̀̈́́̀́̊͗̾͑͐͒͊̈̑͛̈́̄̓̋̿̄͛̈́͑͆̊̒͆͑̌͒̀̄̓̔͗̍͌͊̓̏͌̅̑̉͛̋͆͊͆͋̓́͑̾̀̓͋̌̀͆̊̇͊̄́͐́̏̋̇̿̉̉̏͆͛͆̾̈͗̅̏̀̔̓̈̈́̏̀̔̾̈́̅́̄̋͗̌̓͊̔͒̅̌̉̎̐͛̽̔̈̄̄̄̏̋̿̏̾̿̌̄̽̑̽̀͛͐̅̔̒̈́̉̿̏̑̓͑̉͋́̀̇̅̏̀̀͛̋͗͊̀̓̏̽̑̍̋̀̓̊̐̅͌̅̑̆̑̈́̔̀͛̄̅̃̇͒̽̅͊͂̃̇̔͌̊̓́͐̆̏̓̎̈́͒̾̀̓̾̋̈́̆̀͗̆̅̂͌͐͋͘̚͘̕͘͘͘̕̚̕̕͘̕̚͘̚̕͜͜͜͜͝͠͠͝͠͠ͅͅļ̶̡̧̢̨̢̧̧̡̨̧̧̡̢̡̢̧̧̢̡̧̡̨̡̧̢̛̛̛̛͙͓͎̺̺͓̟̬̼͕͈͎̝͉̗͙̯̳̦̝̲̝͈̳̙͍͎͖̠̟̪̗͍̲̣̲̣̟̬͈̗̖̹̞̞̤̥̹͍̞̯̼̳̟̦̠̫͚̺̜̬͓̙̙̹̖̤̳̠̱͓͖͈̼̱̖͕̣͈̰͇̻̣͕̯̟̞̜̯͖͈̫̝͔͎͚̮̥̦̠̟̪͍͖̱͙̖̱̱͕̙͖͔̝̥͍͙͓̗̤͙̼̙̯̩͈͇̣͔̼̗̹̖̜̦͓̝̤̞̭͖͇̫̖̞̗͚̪̖̟̘̲͕̮͖͕͙̥͍̬͖̘͇̞̜͖͖̫͍̼͕̥̭͓̘̯͓̦̬̻̬͍̜̯͔͕͚̼̤̞̲̣̤̝͍̰̯̬̫̹̩̬͎̪̲̲̣̤͔̫̠̄̓̽͑̔̂͋̈́̊̊̔͒͐̇̒͑̈́́̎̎̿̒̍̍̃͊̈́́̂͑̒̈́̉̈́́̅̃̓͛̂̈́͑͋̆̽̽̒̌̄̽̿̅̋̃͛͐̒̄̈́̃͗̍͗̀̆̅̈́͆̉̑̐́́̆̿̀̀͗̀͛̅̊̀̒́̀͂̀̌̂͆̋͑̂͒̊̒̑̎̅͊̃͌̂͂́̅̉͆̂̒̿͂̃̿̉̃̀̌̓̂͆͊̑̒̾̿̀̃̎̈́͂̋̏̀͒̈́͆͌̈́̅̋̓͂̀͌̔͗̊̌̽̊̌͆̾̄̔̀͗̓̂̃̐̐̈͋̌͌̓͛͆̎̀̊̀́̀̈́͐͒́͆̓̈́̍͋̎͆̽͌̀́̐͌̀̈́̾̾̿́̍̀͗̂̀̀̎͗͑̌͆̌̔̆̑͐̓̐͆̋͗̐̽̊̈̃͂̈́̅̈͋́̃̕̕͘̚̕̕̚͘̕̚̕͘̚͘̕̕͘̚͜͜͜͜͜͠͝͠͠͝͝͝͠͝͠͝͝͝ͅͅͅ ͮ ͯͭ Ͱ ͫͬ ˿ ̀",
  " ̛̜̚ ̝̞ ̡̟̠ ̢̣ ̤̥ ̧̦ ̨ ̩̪ ̫̬̭ ̮̯ ̰̱ ̲ ̴̵̳ ̸̹ ̺ ̻ ̼",
  "l",
  "  l ̛̜̚ ̝̞ ̡̟̠ ̢̣ ̤̥ ̧̦ ̨ ̩̪ ̫̬̭ ̮̯ ̰̱ ̲ ̴̵̳ ̸̹ ̺ ̻ ̼",
  "♡ ゜ * ✧・ ♡ ✧. °",
  " :ȯ:"
];
var text;
var descriptionWindow = document.getElementById("description"), descriptionText = document.getElementById("descriptionText"), button = document.getElementById("start");
window.onload = function() {
  var heightOfBackground = document.getElementById("transparentandhuesky")
    .offsetHeight;
  twitterlink.style.height = (heightOfBackground * 72) / 100 + "px";
  console.log(heightOfBackground);
  console.log(twitterlink.style.height);
  
  descriptionWindow.style.background = "#00F309";
  // twitterlink.style.background = "#00F309";
  
  descriptionWindow.style.border = "3px dashed #FE0BF5";
  descriptionText.style.color = "#FF0CF6";
  
  
  // button.style.color = "#FF0CF6";
  // button.style.background = "black";
  
  
  // descriptionWindow.style.color = "#00F309";
  // twitterlink.style.color = "#00F309";
};

function removeButtonAndBack() {
  descriptionText.innerHTML = "wait wait wait <br>for for for<br>wait wait wait <br>for for for<br>";
  button.style.display = "block";
  document.getElementById("butttonONSTART").style.display = "none";
  document.getElementById("introBack").classList.add("dissapearslowly");
  twitterlink.classList.remove("twitterlinkONTHESTART");
  twitterlink.classList.add("twitterlinkAFTER");
  document.getElementById("logoBlack").style.display = "none";
  descriptionWindow.classList.add("changeColor");
  setTimeout(removethat, 3000);
}

function removethat() {
  document.getElementById("introBack").style.display = "none";
  descriptionWindow.classList.remove("changeColor");
  descriptionWindow.style.background = "#FFFFFF";
  // twitterlink.style.background = "#FFFFFF";
  
  descriptionWindow.style.border = "3px dashed #000000";
  descriptionText.style.color = "#000000";
}

function animation(link) {
  (function() {
    var arrayoftwo = twitterlinkTextArray;
    var arr = twitterlinkSymbolsArray,
      i = -1;

    return (function() {
      if (++i < arr.length) {
        link.innerHTML += arr[i] + "<br>";

        setTimeout(arguments.callee, 50);
      }
    })();
  })();
  link.innerHTML = text;
}

function stopanimation(link) {
  link.innerHTML =
    "h<br>t<br>t<br>p<br>s<br>:<br>/<br>/<br>t<br>w<br>i<br>t<br>t<br>e<br>r<br>.<br>c<br>o<br>m<br>/<br>m<br>o<br>n<br>o<br>l<br>e<br>s<br>a<br>n";
}
